class Hymn {
  String type;
  int number;
  String kanTitle;
  String kanText;
  String kanCategory;
  String kanAlphabet;

  Hymn(
    this.type,
    this.number,
    this.kanTitle,
    this.kanText,
    this.kanCategory,
    this.kanAlphabet,
  );

  static List<Hymn> hymns = [
    Hymn('K', 1, 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!\n\nಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\n\ngಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!\n\nಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\n\nಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!\n\nಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!','ಮಾನ','ಕ'),
    Hymn('K', 2, 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!','ಮಾನ','ಕ'),
    Hymn('K', 3, 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!','ಮಾನ','ಕ'),
    Hymn('K', 4, 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\n\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!','ಮಾನ','ಕ'),
    Hymn('K', 5, 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!','ಮಾನ','ಕ'),
    Hymn('K', 6, 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\n\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!','ಮಾನ','ಕ'),
    Hymn('K', 7, 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!','ಮಾನ','ಕ'),
    Hymn('K', 8, 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\n\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!','ಮಾನ','ಕ'),
    Hymn('K', 9, 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!','ಮಾನ','ಕ'),
    Hymn('K', 10, 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\n\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!','ಮಾನ','ಭ'),
    Hymn('K', 11, 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!','ಮಾನ','ಭ'),
    Hymn('K', 12, 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\n\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!','ಕ್ರಿಸ್ತ್ಯೇಸು','ಭ'),
    Hymn('K', 13, 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!','ಕ್ರಿಸ್ತ್ಯೇಸು','ಭ'),
    Hymn('K', 14, 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\n\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!','ಕ್ರಿಸ್ತ್ಯೇಸು','ಭ'),
  ];
}
