class Hymn {
  String lang;
  String number;
  String kanTitle;
  String kanText;

  Hymn(
    this.lang,
    this.number,
    this.kanTitle,
    this.kanText,
  );

  static List<Hymn> hymns = [
    Hymn('K', '195', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!'),
    Hymn('K', '196', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\n\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!'),
    Hymn('K', '195', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!'),
    Hymn('K', '196', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\n\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!'),
    Hymn('K', '195', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!'),
    Hymn('K', '196', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\n\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!'),
    Hymn('K', '195', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!'),
    Hymn('K', '196', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\n\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!'),
    Hymn('K', '195', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!'),
    Hymn('K', '196', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\n\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!'),
    Hymn('K', '195', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!'),
    Hymn('K', '196', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\n\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!'),
    Hymn('K', '95', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ', 'ಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!'),
    Hymn('K', '96', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ', 'ಭೂದ್ರವ್ಯ ಬೇಡ, ಬೇಡ ಮಾನ\n\nಕ್ರಿಸ್ತ್ಯೇಸು ನಿನ್ನ ಮಾನಕ್ಕಾಗಿ\n\nನಾನೊಂದು ಪಾತ್ರೆ ಆಗಲಿ!'),
  ];
}
